Debjit230/ESP8266-EXPERIMENT/src/main.cpp
void loadCredentials() {
  EEPROM.begin(EEPROM_SIZE);
  if (EEPROM.read(0) == EEPROM_MAGIC) {
    for (int i = 0; i < 32; i++) target_ssid[i] = EEPROM.read(1 + i);
    target_ssid[32] = '\0';
    for (int i = 0; i < 64; i++) target_password[i] = EEPROM.read(33 + i);
    target_password[64] = '\0';

    uint8_t storedBright = EEPROM.read(EEPROM_BRIGHT_ADDR);
    if (storedBright >= 1 && storedBright <= 255) {
      userBrightness = storedBright;
    } else {
      userBrightness = 255;
    }

    uint8_t storedDim = EEPROM.read(EEPROM_AUTODIM_ADDR);
    autoDimEnabled = (storedDim == 1);

    uint8_t storedLockEn = EEPROM.read(EEPROM_AUTOLOCK_EN_ADDR);
    autoLockEnabled = (storedLockEn != 0);

    uint8_t storedLockSec = EEPROM.read(EEPROM_AUTOLOCK_SEC_ADDR);
    if (storedLockSec >= 15 && storedLockSec <= 300) {
      autoLockSeconds = storedLockSec;
    } else {
      autoLockSeconds = 60;
    }
  } else {
    strncpy(target_ssid, "Airfiber-3rdFloorBachelor", sizeof(target_ssid));
    strncpy(target_password, "Airfiber-3rdfloor", sizeof(target_password));
    userBrightness = 255;
    autoDimEnabled = false;
    autoLockEnabled = true;
    autoLockSeconds = 60;
  }
}

void saveSettings(const String& newSSID, const String& newPass, uint8_t newBright, bool newDim, bool newLockEn, uint16_t newLockSec) {
  EEPROM.write(0, EEPROM_MAGIC);
  for (int i = 0; i < 32; i++) {
    EEPROM.write(1 + i, i < (int)newSSID.length() ? newSSID[i] : 0);
  }
  for (int i = 0; i < 64; i++) {
    EEPROM.write(33 + i, i < (int)newPass.length() ? newPass[i] : 0);
  }
  EEPROM.write(EEPROM_BRIGHT_ADDR, newBright);
  EEPROM.write(EEPROM_AUTODIM_ADDR, newDim ? 1 : 0);
  EEPROM.write(EEPROM_AUTOLOCK_EN_ADDR, newLockEn ? 1 : 0);
  EEPROM.write(EEPROM_AUTOLOCK_SEC_ADDR, (uint8_t)newLockSec);
  EEPROM.commit();

  newSSID.toCharArray(target_ssid, sizeof(target_ssid));
  newPass.toCharArray(target_password, sizeof(target_password));
  userBrightness = newBright;
  autoDimEnabled = newDim;
  autoLockEnabled = newLockEn;
  autoLockSeconds = newLockSec;
}

void registerTarget(uint8_t* mac, int rssi) {
  int targetIndex = -1;
  for (int i = 0; i < MAX_TARGETS; i++) {
    if (targets[i].active && memcmp(targets[i].mac, mac, 6) == 0) {
      targetIndex = i;
      break;
    }
  }

  if (targetIndex == -1) {
    for (int i = 0; i < MAX_TARGETS; i++) {
      if (!targets[i].active) {
        targetIndex = i;
        break;
      }
    }
  }

  if (targetIndex == -1) targetIndex = random(0, MAX_TARGETS);

  memcpy(targets[targetIndex].mac, mac, 6);
  targets[targetIndex].rssi = rssi;
  targets[targetIndex].lastSeen = millis();

  if (!targets[targetIndex].active) {
    targets[targetIndex].angle = random(0, 360) * (PI / 180.0);
  }
  targets[targetIndex].active = true;

  triggerLedAlert();

  if (isDeviceLocked) {
    setEmotion(EMO_SUSPICIOUS);
  }
}

void snifferCallback(uint8_t *buf, uint16_t len) {
  if (len == 12) return;

  struct SnifferPacket *sniffer = (struct SnifferPacket*) buf;
  int rssi = sniffer->rx_ctrl.rssi;

  if (sniffer->buf[0] == 0x40) {
    uint8_t *srcMac = &sniffer->buf[10];
    registerTarget(srcMac, rssi);
  }
}

void triggerWifiScan() {
  scanningInProgress = true;
  WiFi.scanNetworksAsync([](int networksFound) {
    totalNetworksFound = networksFound;
    scanningInProgress = false;
  });
}

void handleRoot() {
  if (currentMode == MODE_AP_CONFIG) {
    WiFi.mode(WIFI_AP_STA);
    int n = WiFi.scanNetworks();

    String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>body{font-family:Arial,sans-serif;background:#121212;color:#eee;text-align:center;padding:20px;}";
    html += "form{background:#1f1f1f;padding:22px;border-radius:12px;display:inline-block;max-width:340px;width:100%;box-sizing:border-box;}";
    html += "select,input[type=password],input[type=text]{width:100%;padding:10px;margin:8px 0 16px 0;border-radius:6px;border:1px solid #333;background:#2a2a2a;color:#fff;box-sizing:border-box;}";
    html += ".slider-container{margin:15px 0 10px 0;text-align:left;}";
    html += ".toggle-container{margin:15px 0 12px 0;text-align:left;display:flex;align-items:center;}";
    html += "input[type=range]{width:100%;margin:10px 0;accent-color:#00bcd4;cursor:pointer;}";
    html += "input[type=checkbox]{width:18px;height:18px;margin-right:10px;accent-color:#00bcd4;cursor:pointer;}";
    html += "input[type=submit]{width:100%;background:#00bcd4;color:#fff;padding:12px;border:none;border-radius:6px;font-weight:bold;font-size:16px;cursor:pointer;margin-top:12px;}";
    html += "label{font-size:14px;color:#aaa;display:block;text-align:left;font-weight:bold;}";
    html += ".val-badge{float:right;color:#00bcd4;font-size:14px;}";
    html += "</style></head><body><h2>Sentinel AP Setup</h2>";
    html += "<form method='POST' action='/save'>";
    html += "<label>Select Nearby Wi-Fi:</label><select name='ssid'>";

    if (n == 0) {
      html += "<option value=''>No networks found</option>";
    } else {
      for (int i = 0; i < n; ++i) {
        String s = WiFi.SSID(i);
        s.trim();
        if (s.length() > 0) {
          String selected = (s == String(target_ssid)) ? " selected" : "";
          html += "<option value='" + s + "'" + selected + ">" + s + " (" + String(WiFi.RSSI(i)) + " dBm)</option>";
        }
      }
    }

    html += "</select><label>Password:</label>";
    html += "<input type='password' name='pass' value='" + String(target_password) + "'><br>";

    html += "<div class='slider-container'>";
    html += "<label>Manual Brightness: <span id='bVal' class='val-badge'>" + String(userBrightness) + "</span></label>";
    html += "<input type='range' name='bright' min='1' max='255' value='" + String(userBrightness) + "' oninput=\"document.getElementById('bVal').innerText=this.value;\">";
    html += "</div>";

    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='autodim' name='autodim' value='1'" + String(autoDimEnabled ? " checked" : "") + ">";
    html += "<label for='autodim' style='font-size:13px;cursor:pointer;color:#eee;'>Auto-dim on Lock / Clock</label>";
    html += "</div>";

