Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  // 1. Alert Pulse Auto-Shutoff (120ms)
  if (alertLedActive && (currentMillis - alertLedStart >= LED_ALERT_DURATION)) {
    alertLedActive = false;
    shutoffLeds();
  }

  // 2. Button Engine (Single-Click, Fast Double-Click, and Context-Aware Hold)
  if (currentMillis - lastButtonCheck >= 25) {
    lastButtonCheck = currentMillis;
    bool pinState = (digitalRead(BUTTON_PIN) == LOW);

    if (pinState && !buttonIsPressed) {
      buttonIsPressed = true;
      buttonPressStartTime = currentMillis;
      holdThresholdMet = false;
    } 
    else if (pinState && buttonIsPressed) {
      unsigned long heldTime = currentMillis - buttonPressStartTime;

      if (!holdThresholdMet) {
        if (isDeviceLocked && heldTime >= 700) {
          holdThresholdMet = true;
          clickCount = 0;
          isPeekClockActive = false;
          setEmotion(EMO_DIZZY);
        }
        else if (!isDeviceLocked && heldTime >= 2000) {
          holdThresholdMet = true;
          clickCount = 0;
          lastUserActivity = currentMillis;
          isClockModeActive = false;
          configureMode(MODE_AP_CONFIG);
        } 
        else if (!isDeviceLocked && heldTime >= 400) {
          display.fillRect(10, 56, (heldTime - 400) * 108 / 1600, 4, SSD1306_WHITE);
          display.display();
        }
      }
    } 
    else if (!pinState && buttonIsPressed) {
      buttonIsPressed = false;
      unsigned long duration = currentMillis - buttonPressStartTime;

      if (duration < 600 && !holdThresholdMet) {
        clickCount++;
        lastClickTime = currentMillis;

        if (clickCount == 2) {
          clickCount = 0;
          if (isDeviceLocked) {
            unlockDevice();
          } else {
            enterLockScreen();
          }
        }
      }
    }

    if (clickCount == 1 && (currentMillis - lastClickTime > DOUBLE_CLICK_GAP)) {
      clickCount = 0;

      if (isDeviceLocked) {
        isPeekClockActive = true;
        peekClockStartTime = currentMillis;
        display.clearDisplay();
      } else {
        lastUserActivity = currentMillis;

        if (isClockModeActive) {
          isClockModeActive = false;
          setOledBrightness(userBrightness);
          display.clearDisplay();
        } else {
          DeviceMode nextMode;
          if (currentMode == MODE_RADAR)             nextMode = MODE_SCANNER;
          else if (currentMode == MODE_SCANNER)     nextMode = MODE_RF_TRIPWIRE;
          else if (currentMode == MODE_RF_TRIPWIRE) nextMode = MODE_IR_DECODER;
          else                                      nextMode = MODE_RADAR;

          configureMode(nextMode);
        }
      }
    }
  }

  // 3. Automated Locks and Screen Savers
  if (!isDeviceLocked && currentMode != MODE_AP_CONFIG) {
    if (autoLockEnabled && (currentMillis - lastUserActivity >= (unsigned long)autoLockSeconds * 1000UL)) {
      enterLockScreen();
    } 
    else if (!isClockModeActive && (currentMillis - lastUserActivity >= CLOCK_TIMEOUT_MS)) {
      isClockModeActive = true;
      if (autoDimEnabled) {
        uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
        setOledBrightness(dimLevel);
      } else {
        setOledBrightness(userBrightness);
      }
      display.clearDisplay();
    }
  }

  // Auto-expire 3-second clock peek while locked
  if (isDeviceLocked && isPeekClockActive && (currentMillis - peekClockStartTime >= PEEK_CLOCK_DURATION)) {
    isPeekClockActive = false;
    display.clearDisplay();
  }

  // 4. UI Display Handlers
  if (isDeviceLocked) {
    if (isPeekClockActive) {
      if (currentMillis - lastDisplayDraw >= 200) {
        lastDisplayDraw = currentMillis;
        drawClockUI();
      }
    } else {
      if (currentMillis - lastDisplayDraw >= 30) {
        lastDisplayDraw = currentMillis;
        drawEmoFace();
      }
    }
  } else if (isClockModeActive) {
    if (currentMillis - lastDisplayDraw >= 500) {
      lastDisplayDraw = currentMillis;
      drawClockUI();
    }
  }

  // 5. Active & Background Logic Execution
  switch (currentMode) {
    case MODE_RADAR: {
      if (currentMillis - lastChannelHop >= 180) {
        lastChannelHop = currentMillis;
        currentChannel++;
        if (currentChannel > 13) currentChannel = 1;
        wifi_set_channel(currentChannel);
      }

      if (!isDeviceLocked && !isClockModeActive && (currentMillis - lastDisplayDraw >= 50)) {
        lastDisplayDraw = currentMillis;
        sweepAngle += 0.15;
        if (sweepAngle >= 2 * PI) sweepAngle = 0;
        drawRadarUI();
      }
      break;
    }

    case MODE_SCANNER: {
      if (!isDeviceLocked) {
        if (!scanningInProgress && (currentMillis - lastScanTime >= SCAN_INTERVAL)) {
          lastScanTime = currentMillis;
          triggerWifiScan();
        }

        if (!isClockModeActive && (currentMillis - lastDisplayDraw >= 200)) {
          lastDisplayDraw = currentMillis;
          drawScannerUI();
        }
      }
      break;
    }

    case MODE_RF_TRIPWIRE: {
      if (WiFi.status() != WL_CONNECTED) {
        if (!isDeviceLocked && !isClockModeActive && (currentMillis - lastDisplayDraw >= 300)) {
          lastDisplayDraw = currentMillis;
          display.clearDisplay();
          display.setTextColor(SSD1306_WHITE);
          display.setTextSize(1);
          display.setCursor(0, 24);
          display.println("Connecting to AP...");
          display.display();
        }
        break;
      }

      if (!baselineInitialized) {
        baselineRSSI = (float)WiFi.RSSI();
        baselineInitialized = true;
        isCalibrating = true;
        calibrationStartTime = currentMillis;
        maxNoiseObserved = 0.0;
        break;
      }

      if (currentMillis - lastSampleTime >= SAMPLE_RATE_MS) {
        lastSampleTime = currentMillis;
        int currentRssi = WiFi.RSSI();

        baselineRSSI = (EMA_ALPHA * (float)currentRssi) + ((1.0 - EMA_ALPHA) * baselineRSSI);
        float delta = abs((float)currentRssi - baselineRSSI);

        if (isCalibrating) {
          if (delta > maxNoiseObserved) {
            maxNoiseObserved = delta;
          }

