Debjit230/ESP8266-EXPERIMENT/src/main.cpp
          unsigned long elapsed = currentMillis - calibrationStartTime;
          if (elapsed >= 5000) {
            dynamicThreshold = maxNoiseObserved + 1.0;
            if (dynamicThreshold < 2.0) dynamicThreshold = 2.0;
            isCalibrating = false;
          }

          if (!isDeviceLocked && !isClockModeActive) {
            display.clearDisplay();
            display.setTextColor(SSD1306_WHITE);
            display.setTextSize(1);
            display.setCursor(0, 8);
            display.println("CALIBRATING ROOM...");
            display.setCursor(0, 24);
            display.printf("Remain: %lus", (5000 - elapsed) / 1000 + 1);
            display.setCursor(0, 38);
            display.printf("Noise : %.1fdB", maxNoiseObserved);
            display.setCursor(0, 50);
            display.println("Keep area clear!");
            display.display();
          }
          break;
        }

        if (delta >= dynamicThreshold) {
          lastMotionDetected = currentMillis;
          triggerLedAlert();

          if (isDeviceLocked) {
            setEmotion(EMO_SHOCKED);
          }
        }

        bool isMotionActive = (currentMillis - lastMotionDetected < ALARM_HOLD_TIME);

        int yVal = 42 - (int)(((float)currentRssi - baselineRSSI) * 3.5);
        yVal = constrain(yVal, 22, 62);

        waveBuffer[waveIndex] = yVal;
        waveIndex = (waveIndex + 1) % WAVE_POINTS;

        if (!isDeviceLocked && !isClockModeActive) {
          drawTripwireUI(delta, currentRssi, isMotionActive);
        }
      }
      break;
    }

    case MODE_IR_DECODER: {
      if (irrecv.decode(&irResults)) {
        bool isValidSignal = (irResults.decode_type != decode_type_t::UNKNOWN) &&
                             (irResults.bits >= 8) &&
                             (irResults.value != 0);

        if (isValidSignal) {
          lastProtocol = typeToString(irResults.decode_type);
          lastHexCode  = "0x" + uint64ToString(irResults.value, HEX);
          lastBits     = irResults.bits;

          triggerLedAlert();

          if (isDeviceLocked) {
            setEmotion(EMO_WINK);
          } else {
            lastUserActivity = currentMillis;
            if (isClockModeActive) {
              isClockModeActive = false;
              setOledBrightness(userBrightness);
              display.clearDisplay();
            }
          }
        }
        irrecv.resume();
      }

      if (!isDeviceLocked && !isClockModeActive && (currentMillis - lastDisplayDraw >= 100)) {
        lastDisplayDraw = currentMillis;
        drawDecoderUI();
      }
      break;
    }

    case MODE_AP_CONFIG: {
      server.handleClient();

      if (currentMillis - lastDisplayDraw >= 300) {
        lastDisplayDraw = currentMillis;
        drawConfigUI();
      }
      break;
    }
  }
}